---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurvesCollinear
source: html/6f433812-1259-e5ba-1f8c-3556f24e2109.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurvesCollinear Property

Collinear segments are not allowed in a Rebar Shape definition.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurvesCollinear { get; }
```